OpFile/Humidity/system/air/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
humidityKSource
{
    type            scalarSemiImplicitSource;
    active          yes;

    scalarSemiImplicitSourceCoeffs
    {
        selectionMode   all;
        volumeMode      absolute;

        injectionRateSuSp
        {
            k   (8  -1);
        }
    }
}


//************************************************************************** //